In [3]:
import numpy as np
import pandas as pd

In [4]:
x=np.array([2,3,5,7,11,13])
x*2

array([ 4,  6, 10, 14, 22, 26])

In [5]:
data=['peter','paul','mary','guIDo']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [6]:
names=pd.Series(data)
names.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [7]:
names.str.lower()

0    peter
1     paul
2     mary
3    guido
dtype: object

In [8]:
names.str.len()

0    5
1    4
2    4
3    5
dtype: int64

In [9]:
names.str.startswith('p')

0     True
1     True
2    False
3    False
dtype: bool

In [10]:
monte = pd.Series(['Graham Chapman jabban', 'John Cleese', 'Terry Gilliam',
'Eric Idle', 'Terry Jones', 'Michael Palin'])
monte.str.split()
# split function splits words inside brackets if space found

0    [Graham, Chapman, jabban]
1               [John, Cleese]
2             [Terry, Gilliam]
3                 [Eric, Idle]
4               [Terry, Jones]
5             [Michael, Palin]
dtype: object

In [11]:
monte.str.lower()

0    graham chapman jabban
1              john cleese
2            terry gilliam
3                eric idle
4              terry jones
5            michael palin
dtype: object

In [12]:
monte.str.capitalize()

0    Graham chapman jabban
1              John cleese
2            Terry gilliam
3                Eric idle
4              Terry jones
5            Michael palin
dtype: object

In [13]:
monte.str.len()

0    21
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [14]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [32]:
monte.str.split()

0    [Graham, Chapman, jabban]
1               [John, Cleese]
2             [Terry, Gilliam]
3                 [Eric, Idle]
4               [Terry, Jones]
5             [Michael, Palin]
dtype: object

In [27]:
print(monte.str.extract('([A-Za-z]+)'))
# extracting strings of particular letters
# if i wanna print strings only upto p
print(monte.str.extract('([A-Za-p]+)'))

         0
0   Graham
1     John
2    Terry
3     Eric
4    Terry
5  Michael
         0
0        G
1     John
2       Te
3        E
4       Te
5  Michael

In [34]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman jabban]
1                         []
2            [Terry Gilliam]
3                         []
4              [Terry Jones]
5            [Michael Palin]
dtype: object

In [37]:
print(monte.str[0:3])
monte.str[0:10]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

0    Graham Cha
1    John Clees
2    Terry Gill
3     Eric Idle
4    Terry Jone
5    Michael Pa
dtype: object

In [43]:
monte.str.split().str.get(0)

0     Graham
1       John
2      Terry
3       Eric
4      Terry
5    Michael
dtype: object

In [44]:
monte.str.split().str.get(-1)

0     jabban
1     Cleese
2    Gilliam
3       Idle
4      Jones
5      Palin
dtype: object

In [50]:
full_monte=pd.DataFrame({'name':monte,
                         'info':['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C','B|C|D']})
full_monte

                    name   info
0  Graham Chapman jabban  B|C|D
1            John Cleese    B|D
2          Terry Gilliam    A|C
3              Eric Idle    B|D
4            Terry Jones    B|C
5          Michael Palin  B|C|D